# Напишите функцию draw_triangle(), которая выводит звездный прямоугольный треугольник с катетами, равными 10
def draw_triangle():
    for i in range(10):
        print('*'*(i + 1))
# основная программа
draw_triangle()  # вызов функции
